{"pages":[{"title":"404","text":"","path":"404/index.html","date":"09-11","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"09-11","excerpt":""},{"title":"about","text":"","path":"about/index.html","date":"09-12","excerpt":""},{"title":"分类","text":"","path":"categories/index.html","date":"09-12","excerpt":""}],"posts":[{"title":"2018湖南省赛总结","text":"前言怎么说呢？我大二开始接触acm,（大一基本没用计算机）刚开始也觉得没啥兴趣，不过后来去打了一次天梯赛和ccpc邀请赛后就觉得这个比赛还是非常不错的，是一个非常不错的平台。在大学这个比较懒散的地方（尤其是我这种弱校），这个比赛还是能带给我们一点正能量的东西的。 其实一直感觉自己的计算机学得不好，刚开始的时候就是复制粘贴，现在导致我的 coding 能力一直比较差，（个人建议平时一定要自己敲，就算是板子，也要理解之后一步一步的自己敲出来，然后日益改进一下，到时候你的板子就能敲得非常快，并且对板子有更深层次的理解，能够针对题目做出各种变化）然后就是扩大自己的知识面吧，各种算法，还有数学也是很重要的。关于这方面的训练：我觉得不能三天打鱼，两天晒网，因为代码能力，思维能力本身就是需要长时间磨合的一个过程。并且加上acm刷题本来就慢。所以acm训练需要长时间的训练才能有所提高。暑假集训的时候，上午3个小时，下午3个小时也确实少了点。毕竟高中一个同学从早上起来一直干到晚上，在他们学校比较常见，比赛情况相比较我来说好了太多，国家级的奖项有4个，还有一个icpc 亚洲区域赛铜。但是他今年退役了。 正文好了，废话说了一大篇，接下来说一下省赛，这次比赛我完全就是打算来躺鸡的。因为队长kaven这方面还不错，coding 能力比我好太多，见识也比较广，算法，数论知识点面比较全面。所以就是他主码啦 第一，二题我都没看，队友直接a了， 我就在傍边看英文题，英文题放的比较难啊。全场感觉除了雅礼的高中生做出来几乎没有人做出来。一道是多操作的求连通块的题，但是一般连通块就是一维的，他这个是二维的，本来预处理就比较麻烦了。所以这题弃了。 还有一道最小生成树的题，咋看一喜，以为可做，但是这个是求n个最小生成树，f(1)代表1个结点的最小生成树，f(n)表示1到n结点的最小生成树，f(1)一直到f(n)全部要求出来，哦豁，这题又凉了。果然最后封榜也没几个队做出来。 第三题 2018 数据很大，不用想肯定可以数学推导出来，但是说实话，除了数学大佬，一般都是找规律要比推导快得多。所以还是找规律了，和队友一直找一直找，猜了好多，最后发现就是对称的，怎么说呢？题目好像是下方和左方是2018的约数吗，那么规律就是上方和右方的数加起来平方，我曹，玄学啊，妙，佩服叉姐。 第四题：千万别用树套树 队友说以前写过类似的，整体二分+树状数组 解决（额，好多好东西我暑假才知道啊，后悔以前荒废了青春，不然打acm真是一件美妙的事情） 第五题：买一送一 感觉不好划分类型，有点像深搜在线做法，就是处理有多少种不同的有序对。开始我以为是先把序列模拟离线出来，然后就是组合问题了（额，题目忘记了）但是序列比较长，另外不好组合。队友想出来了在线后缀的做法，但是wrong了不知道为啥。然后就没时间了。4题省二结束了暑假集训。 现在大三了，但是自己还是希望自己能够提高自己的coding 能力，多开阔自己的视野。多接触各种算法，以及思想。 希望所有acmer最后都能一路向前，不忘初心。","path":"2018/09/14/2018湖南省赛总结/","date":"09-14","excerpt":""},{"title":"测试","text":"","path":"2018/09/11/测试/","date":"09-11","excerpt":""},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2018/09/11/hello-world/","date":"09-11","excerpt":""}]}